I have same issue. I could create firewall from my dashboard, but couldn't create firewall from terraform. Btw, In API Token scope. I don't see Firewall permission.

![image](https://user-images.githubusercontent.com/1505720/112106187-f2a80e80-8bdf-11eb-8136-b506f778d585.png)


This is my log

```
  + create

Terraform will perform the following actions:

  # linode_firewall.fw_inbound_mysql will be created
  + resource "linode_firewall" "fw_inbound_mysql" {
      + devices  = (known after apply)
      + disabled = false
      + id       = (known after apply)
      + label    = "fw_inbound_mysql"
      + status   = (known after apply)
      + tags     = [
          + "mysql",
          + "prod",
        ]

      + inbound {
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ports    = "22, 3306"
          + protocol = "TCP"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

linode_firewall.fw_inbound_mysql: Creating...

Error: failed to create Firewall: [404] Not found
```